import { title } from 'process';

export const links = [
    { id: 0, link: 'about', title: 'О нас' },
    { id: 1, link: 'advantages', title: 'Преимущества' },
    { id: 2, link: 'services', title: 'Услуги' },
    { id: 3, link: 'directory', title: 'Каталог' },
    { id: 4, link: 'contacts', title: 'Контакты' },
];

export const advantagesList = [
    {
        id: 0,
        title: 'Опыт и профессионализм.',
        subtitle: `Наш коллектив состоит из опытных специалистов, которые знают все тонкости процесса импорта и продажи автомобилей.
Мы готовы поделиться своими знаниями и опытом,
чтобы сделать вашу покупку максимально
комфортной и безопасной`,
    },
    {
        id: 1,
        title: 'Индивидуальный подход.',
        subtitle: `У каждого клиента есть свой личный менеджер, который будет сопровождать вас на всех этапах сделки.
Мы учитываем ваши пожелания и потребности,
чтобы предложить наилучшие варианты.`,
    },
    {
        id: 2,
        title: 'Широкий выбор.',
        subtitle: `Предлагаем автомобили из наличия, но наша специализация — импорт под заказ из Южной Кореи,
Китая, США и европейских стран. Вы можете выбрать
любую модель, которая соответствует вашим желаниям
и требованиям.`,
    },
    {
        id: 3,
        title: 'Поддержка на всех этапах.',
        subtitle: `Мы не просто продаём автомобили, но и оказываем всестороннюю поддержку нашим клиентам.
Это включает помощь с оформлением документов, постановкой на учёт, оформлением КАСКО и ОСАГО.`,
    },
    {
        id: 4,
        title: 'Гарантия качества.',
        subtitle: `Предоставляем гарантию на автомобили, включая подержанные. Наша цель — обеспечить вам уверенность в каждой сделке.`,
    },
    {
        id: 5,
        title: 'Своя логистика.',
        subtitle: `Контролируем весь процесс доставки автомобиля,
чтобы гарантировать его сохранность и своевременную доставку.`,
    },
];

export const AdvantageInfo = {
    title: `Добро пожаловать в « Strada Авто » — ваш путь к автомобилю мечты начинается здесь!`,
    description: `« Strada Авто » —  это молодая, динамично развивающаяся компания, которая уже успела зарекомендовать себя на рынке как надёжный партнёр в сфере параллельного импорта первоклассных автомобилей.`,
    descriptionSecond: `Наш главный офис находится в Москве, и мы гордимся тем, что собрали команду профессионалов, которые являются настоящими фанатами своего дела.`,
};

export const ServicesList = [
    {
        id: 0,
        img: '🚢',
        title: 'Прямые поставки',
        subtitle: `Привезем любую модель автомобиля из Южной Кореи, Китая, США и европейских стран.`,
    },
    {
        id: 1,
        title: 'Гарантия качества',
        img: '🔧',
        subtitle: `Предоставляем гарантию на автомобили, включая подержанные.`,
    },

    {
        id: 2,
        title: 'Оформление документов',
        img: '📑',
        subtitle: `Поможем вам оформить все необходимые документы
для постановки автомобиля на учёт.`,
    },
    {
        id: 3,
        title: 'Страхование',
        img: '🛡️',
        subtitle: `Надёжные страховые компаниями, чтобы предложить вам лучшие условия страхования.`,
    },
];

export const directoryList = [
    {
        id: 0,
        title: 'Porsche Cayenne',
        src: '/img/directory1.webp',
        power: '999',
        drive: 'задний',
        volume: '5.5',
        acceleration: '0.99',
        gearbox: 'автомат',
    },
    {
        id: 2,
        title: 'Porsche Cayenne',
        src: '/img/directory2.webp',
        power: '999',
        drive: 'задний',
        volume: '5.5',
        acceleration: '0.99',
        gearbox: 'автомат',
    },
    {
        id: 3,
        title: 'Porsche Cayenne',
        src: '/img/directory3.webp',
        power: '999',
        drive: 'задний',
        volume: '5.5',
        acceleration: '0.99',
        gearbox: 'автомат',
    },
    {
        id: 4,
        title: 'Porsche Cayenne',
        src: '/img/directory4.webp',
        power: '999',
        drive: 'задний',
        volume: '5.5',
        acceleration: '0.99',
        gearbox: 'автомат',
    },
];

export const contactLinks = [
    { id: 0, title: 'Наш ТГ канал', link: 'https://t.me/stradaauto', img: 'svg/tg.svg' },
    {
        id: 1,
        title: 'Мой Телеграмм',
        link: 'https://t.me/marat_vanauto',
        img: 'svg/tg.svg',
    },
    { id: 2, title: 'Номер для связи', description: '+7 (993) 634-25-45', img: 'svg/phone.svg' },
];

export const footerContactList = [
    { id: 0, icon: '📍', text: 'Москва, Россия' },
    { id: 1, icon: '📞', text: '+7 (993) 634-25-45' },
    { id: 2, icon: '✉️', text: 'info@strada-auto.ru' },
    { id: 3, icon: '🕒', text: 'Пн-Сб 9:00 - 21:00' },
];
