export const links = [
	{ id: 0, link: 'about', title: 'О нас' },
	{ id: 1, link: 'advantages', title: 'Преимущества' },
	{ id: 2, link: 'directory', title: 'Каталог' },
	{ id: 3, link: 'services', title: 'Услуги' },
	{ id: 4, link: 'contacts', title: 'Контакты' },
]

export const advantagesList = [
	{
		id: 0,
		title: 'Опыт и профессионализм.',
		subtitle: `Наш коллектив состоит из опытных специалистов, которые знают все тонкости процесса импорта и продажи автомобилей.
Мы готовы поделиться своими знаниями и опытом,
чтобы сделать вашу покупку максимально
комфортной и безопасной`,
	},
	{
		id: 1,
		title: 'Индивидуальный подход.',
		subtitle: `У каждого клиента есть свой личный менеджер, который будет сопровождать вас на всех этапах сделки.
Мы учитываем ваши пожелания и потребности,
чтобы предложить наилучшие варианты.`,
	},
	{
		id: 2,
		title: 'Широкий выбор.',
		subtitle: `Предлагаем автомобили из наличия, но наша специализация — импорт под заказ из Южной Кореи,
Китая, США и европейских стран. Вы можете выбрать
любую модель, которая соответствует вашим желаниям
и требованиям.`,
	},
	{
		id: 3,
		title: 'Поддержка на всех этапах.',
		subtitle: `Мы не просто продаём автомобили, но и оказываем всестороннюю поддержку нашим клиентам.
Это включает помощь с оформлением документов, постановкой на учёт, оформлением КАСКО и ОСАГО.`,
	},
	{
		id: 4,
		title: 'Гарантия качества.',
		subtitle: `Предоставляем гарантию на автомобили, включая подержанные. Наша цель — обеспечить вам уверенность в каждой сделке.`,
	},
	{
		id: 5,
		title: 'Своя логистика.',
		subtitle: `Контролируем весь процесс доставки автомобиля,
чтобы гарантировать его сохранность и своевременную доставку.`,
	},
]

export const AdvantageInfo = {
	title: `	Добро пожаловать в
					«YES Авто» — ваш
					путь к автомобилю
					мечты начинается
					здесь!`,
	description: `«YES Авто» — это
					молодая, динамично
					развивающаяся
					компания, которая
					уже успела
					зарекомендовать себя
					на рынке как хуйня
					полная в сфере
					параллельного
					импорта
					первоклассных
					автомобилей.`,
	descriptionSecond: `		Наш главный офис
					находится в
					Октябрьском на
					речке, и мы гордимся
					тем, что собрали
					команду
					профессионалов,
					которые являются
					настоящими фанатами
					своего дела.`,
}
